### Terraform `plan` Failed for Workspace: `default`
<details><summary>Show Output</summary>

```
module.base.module.server.aws_lightsail_static_ip.web: Refreshing state... [id=k2ss_staticip]
module.base.module.server.aws_lightsail_key_pair.web: Refreshing state... [id=k2ss_key]
module.base.module.identity.aws_iam_group.internal_resource_controller: Refreshing state... [id=k2ss-internal-resource-controller]
module.base.module.dns.aws_acm_certificate.main: Refreshing state... [id=arn:aws:acm:ap-northeast-1:054479854625:certificate/3b6a35a9-c98e-4216-be33-41913be0a53a]
module.base.module.server.aws_lightsail_instance.web: Refreshing state... [id=k2ss_instance]
module.base.module.identity.aws_iam_openid_connect_provider.github_actions: Refreshing state... [id=arn:aws:iam::054479854625:oidc-provider/token.actions.githubusercontent.com]
module.base.module.dns.aws_route53_zone.main: Refreshing state... [id=Z07178352UCYZK53WIGH2]
module.base.module.storage.aws_s3_bucket.internal_resource: Refreshing state... [id=k2ss-internal-resource]
module.base.module.identity.data.aws_iam_policy_document.github_actions_policy: Reading...
module.base.module.identity.data.aws_iam_policy_document.github_actions_policy: Read complete after 0s [id=2289236447]
module.base.module.dns.aws_route53_record.main["redmine.k2ss.info_A"]: Refreshing state... [id=Z07178352UCYZK53WIGH2_redmine.k2ss.info_A]
module.base.module.dns.aws_route53_record.main["k2ss.info_TXT"]: Refreshing state... [id=Z07178352UCYZK53WIGH2_k2ss.info_TXT]
module.base.module.dns.aws_route53_record.main["_dmarc.k2ss.info_TXT"]: Refreshing state... [id=Z07178352UCYZK53WIGH2__dmarc.k2ss.info_TXT]
module.base.module.dns.aws_route53_record.main["inishie.k2ss.info_A"]: Refreshing state... [id=Z07178352UCYZK53WIGH2_inishie.k2ss.info_A]
module.base.module.dns.aws_route53_record.main["k2ss.info_MX"]: Refreshing state... [id=Z07178352UCYZK53WIGH2_k2ss.info_MX]
module.base.module.dns.aws_route53_record.main["k2ss.info_A"]: Refreshing state... [id=Z07178352UCYZK53WIGH2_k2ss.info_A]
module.base.module.dns.aws_route53_record.main["*.k2ss.info_A"]: Refreshing state... [id=Z07178352UCYZK53WIGH2_*.k2ss.info_A]
module.base.module.dns.aws_route53_record.main["waaru.k2ss.info_A"]: Refreshing state... [id=Z07178352UCYZK53WIGH2_waaru.k2ss.info_A]
module.base.module.dns.aws_route53_record.main["www.k2ss.info_A"]: Refreshing state... [id=Z07178352UCYZK53WIGH2_www.k2ss.info_A]
module.base.module.dns.aws_route53_record.certificate["*.k2ss.info"]: Refreshing state... [id=Z07178352UCYZK53WIGH2__0a70eb3a1819848e966ab33e38b66b3a.k2ss.info._CNAME]
module.base.module.dns.aws_route53_record.certificate["k2ss.info"]: Refreshing state... [id=Z07178352UCYZK53WIGH2__0a70eb3a1819848e966ab33e38b66b3a.k2ss.info._CNAME]
module.base.module.server.aws_lightsail_static_ip_attachment.web: Refreshing state... [id=k2ss_staticip]
module.base.module.server.aws_lightsail_instance_public_ports.web: Refreshing state... [id=k2ss_instance-1421794143]
module.base.module.storage.aws_s3_bucket_versioning.internal_resource: Refreshing state... [id=k2ss-internal-resource]
module.base.module.storage.aws_s3_bucket_public_access_block.internal_resource: Refreshing state... [id=k2ss-internal-resource]
module.base.module.identity.data.aws_iam_policy_document.internal_resource_controller_policy: Reading...
module.base.module.storage.aws_s3_bucket_server_side_encryption_configuration.internal_resource: Refreshing state... [id=k2ss-internal-resource]
module.base.module.identity.data.aws_iam_policy_document.ci_policy: Reading...
module.base.module.identity.data.aws_iam_policy_document.internal_resource_controller_policy: Read complete after 0s [id=1362393909]
module.base.module.identity.data.aws_iam_policy_document.ci_policy: Read complete after 0s [id=3539625102]
module.base.module.identity.aws_iam_policy.internal_resource_controller_policy: Refreshing state... [id=arn:aws:iam::054479854625:policy/k2ss-internal-resource-controller-policy]
module.base.module.identity.aws_iam_policy.ci_policy: Refreshing state... [id=arn:aws:iam::054479854625:policy/k2ss-ci-policy]
module.base.module.identity.aws_iam_role.ci_role: Refreshing state... [id=k2ss-ci-role]
module.base.module.identity.aws_iam_group_policy_attachment.internal_resource_controller: Refreshing state... [id=k2ss-internal-resource-controller-20230618083439248600000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
😅/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # module.base.module.server.aws_lightsail_instance_public_ports.web must be replaced
😅/+ resource "aws_lightsail_instance_public_ports" "web" {
      ~ id            = "k2ss_instance-1421794143" -> (known after apply)
        # (1 unchanged attribute hidden)

      😅 port_info { # forces replacement
          😅 cidr_list_aliases = [
              😅 "lightsail-connect",
            ] -> null
          😅 cidrs             = [
              😅 "106.155.10.236/32",
            ] -> null
          😅 from_port         = 22 -> null
          😅 ipv6_cidrs        = [] -> null
          😅 protocol          = "tcp" -> null
          😅 to_port           = 22 -> null
        }
      😅 port_info { # forces replacement
          😅 cidr_list_aliases = [] -> null
          😅 cidrs             = [
              😅 "0.0.0.0/0",
            ] -> null
          😅 from_port         = 443 -> null
          😅 ipv6_cidrs        = [
              😅 "::/0",
            ] -> null
          😅 protocol          = "tcp" -> null
          😅 to_port           = 443 -> null
        }
      😅 port_info { # forces replacement
          😅 cidr_list_aliases = [] -> null
          😅 cidrs             = [
              😅 "0.0.0.0/0",
            ] -> null
          😅 from_port         = 80 -> null
          😅 ipv6_cidrs        = [
              😅 "::/0",
            ] -> null
          😅 protocol          = "tcp" -> null
          😅 to_port           = 80 -> null
        }
      + port_info { # forces replacement
          + cidr_list_aliases = (known after apply)
          + cidrs             = (known after apply)
          + from_port         = 443
          + ipv6_cidrs        = (known after apply)
          + protocol          = "tcp"
          + to_port           = 443
        }
      + port_info { # forces replacement
          + cidr_list_aliases = (known after apply)
          + cidrs             = (known after apply)
          + from_port         = 80
          + ipv6_cidrs        = (known after apply)
          + protocol          = "tcp"
          + to_port           = 80
        }
      + port_info { # forces replacement
          + cidr_list_aliases = [
              + "lightsail-connect",
            ]
          + cidrs             = [
              + "106.155.10.236/32",
            ]
          + from_port         = 22
          + ipv6_cidrs        = (known after apply)
          + protocol          = "tcp"
          + to_port           = 22
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
╷
│ Error: Invalid function argument
│ 
│   on modules/server/lightsail.tf line 7, in resource "aws_lightsail_key_pair" "web":
│    7:   public_key = file("~/.ssh/${var.app_name}.pub")
│     ├────────────────
│     │ while calling file(path)
│     │ var.app_name is "k2ss"
│ 
│ Invalid value for "path" parameter: no file exists at "~/.ssh/k2ss.pub";
│ this function works only with files that are distributed as part of the
│ configuration source code, so if this file will be created by a resource in
│ this configuration you must instead obtain this result from an attribute of
│ that resource.
╵
```
</details>